package installations

import (
	"github.com/gin-gonic/gin"
	"log"
)

type Row []string
type Board []Row
type Frame map[string]Board

type FlipdiskVideo struct {
	Installation string     `json:"installation"`
	FPS          int        `json:"fps"`
	Looping      bool       `json:"looping"`
	Layout       [][]string `json:"layout"`
	Frames       []Frame    `json:"frames"`
}

type Playlist struct {
	Name    string          `json:"name"`
	Videos  []FlipdiskVideo `json:"videos"`
	Looping bool            `json:"looping"`
}


// mikronf_5x5 -  https://fontstruct.com/fontstructions/show/74288/mikronf_5x5
// pixelspace_5x5 - https://fontstruct.com/fontstructions/show/42130/
// 5x5 - https://fontstruct.com/fontstructions/show/1916/swos
// ti84_small -  https://fontstruct.com/fontstructions/show/424974/ti84_small
// swos - 5x5 https://fontstruct.com/fontstructions/show/1916/swos

//TOdo for JImmy
//Complete fontmap below with all Alphabets in both lower and uppercase
//Just use ti84_small for now
//move this into font maps folder
//write the function render the font maps
//end goal is to make the streams live in the font maps folder

func GetPlaying(c *gin.Context) {
	siteName := c.Param("siteName")

	log.Println("sending payload stub for: ", siteName)

	video := FlipdiskVideo{
		Installation: siteName,
		FPS:          1,
		Looping:      true,
		Layout: [][]string{
			[]string{"A", "B", "C", "D", "E",
							 "F", "G", "H", "I", "J",
							 "K", "L", "M", "N", "O",
							 "P", "Q", "R", "S", "T",
							 "U", "V", "W", "X", "Y", "Z"},
			[]string{"a", "b", "c", "d", "e",
			 	 			 "f", "g", "h", "i", "j",
			 	 			 "k", "l", "m", "n", "o",
			 	 			 "p", "q", "r", "s", "t",
			 	 			 "u", "v", "w", "x", "y", "z"},
		},
		Frames: []Frame{
			Frame{
				"A": Board{
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
				},
				"B": Board{
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
				},
				"C": Board{
					Row{"⚪️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚫️",},
				},
				"D": Board{
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
				},
				"E": Board{
					Row{"⚫️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚫️",},
				},
				"F": Board{
					Row{"⚫️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
				},
				"G": Board{
					Row{"⚪️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚫️",},
				},
				"H": Board{
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
				},
				"I": Board{
					Row{"⚫️", "⚫️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚫️", "⚫️",},
				},
				"J": Board{
					Row{"⚪️", "⚪️", "⚫️",},
					Row{"⚪️", "⚪️", "⚫️",},
					Row{"⚪️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚫️",},
				},
				"K": Board{
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
				},
				"L": Board{
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚫️",},
				},
				"M": Board{
					Row{"⚫️", "⚪️", "⚪️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️", "⚪️", "⚫️",},
				},
				"N": Board{
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
				},
				"O": Board{
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
				},
				"P": Board{
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
				},
				"Q": Board{
					Row{"⚫️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚫️",},
					Row{"⚪️", "⚫️", "⚫️",},
				},
				"R": Board{
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
				},
				"S": Board{
					Row{"⚪️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
				},
				"T": Board{
					Row{"⚫️", "⚫️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
				},
				"U": Board{
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
				},
				"V": Board{
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
				},
				"W": Board{
					Row{"⚫️", "⚪️", "⚪️","⚪️","⚫️",},
					Row{"⚫️", "⚪️", "⚪️","⚪️","⚫️",},
					Row{"⚫️", "⚪️", "⚫️","⚪️","⚫️",},
					Row{"⚫️", "⚫️", "⚪️","⚫️","⚫️",},
					Row{"⚫️", "⚪️", "⚪️","⚪️","⚫️",},
				},
				"X": Board{
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
				},
				"Y": Board{
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
				},
				"Z": Board{
					Row{"⚫️", "⚫️", "⚫️",},
					Row{"⚪️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚫️",},
				},
				"a": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚫️",},
				},
				"b": Board{
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
				},
				"c": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚫️",},
				},
				"d": Board{
					Row{"⚪️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚫️",},
				},
				"e": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚫️",},
				},
				"f": Board{
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
				},
				"g": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
				},
				"h": Board{
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
				},
				"i": Board{
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
				},
				"j": Board{
					Row{"⚪️", "⚪️", "⚫️",},
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚪️", "⚪️", "⚫️",},
					Row{"⚪️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
				},
				"k": Board{
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
				},
				"l": Board{
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
				},
				"m": Board{
					Row{"⚪️", "⚪️", "⚪️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚪️", "⚪️", "⚫️",},
				},
				"n": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
				},
				"o": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
				},
				"p": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
				},
				"q": Board{
					Row{"⚪️", "⚪️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚫️", "⚪️",},
					Row{"⚪️", "⚪️", "⚫️", "⚫️",},
				},
				"r": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
				},
				"s": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚫️", "⚪️",},
				},
				"t": Board{
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
				},
				"u": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚫️", "⚫️",},
				},
				"v": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
				},
				"w": Board{
					Row{"⚪️", "⚪️", "⚪️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️", "⚫️", "⚪️",},
				},
				"x": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
				},
				"y": Board{
					Row{"⚪️", "⚪️", "⚪️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚫️", "⚪️", "⚫️",},
					Row{"⚪️", "⚫️", "⚪️",},
					Row{"⚫️", "⚪️", "⚪️",},
				},
				"z": Board{
					Row{"⚪️", "⚪️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚫️", "⚫️",},
					Row{"⚪️", "⚪️", "⚫️", "⚪️",},
					Row{"⚪️", "⚫️", "⚪️", "⚪️",},
					Row{"⚫️", "⚫️", "⚫️", "⚫️",},
				},
			},
		},
	}

	playlist := Playlist{
		Name: "now showing",
		Videos: []FlipdiskVideo{
			video,
		},
	}

	c.JSON(200, playlist)
}
